Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བཞིན་གཤེགས་པས་བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་གཏོགས་པའི་སྲོག་ཆགས་མངོན་པར་སྤྲུལ་པ་མཛད་ཅིང་དེ་མངོན་པར་སྤྲུལ་ནས་སངས་རྒྱས་ཀྱི་ཕྲིན་ལས་མཛད་པ་དེ་ལྟ་བུ་ཡོད་དམ་མེད།
en: Subhūti, can the tathāgatas conjure up a creature within the animal realm, and having conjured up that form, then engage in buddha activities?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་མཆིས་སོ།
en: asked the Blessed One. “

source: རབ་འབྱོར་དེས་དེ་བཞིན་གཤེགས་པ་བྱོལ་སོང་གི་སྐྱེ་གནས་པར་འགྱུར་རམ།
en: For that reason, Subhūti, do the tathāgatas become an animal?”

source: རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་བྱོལ་སོང་གི་སྐྱེ་གནས་ཀྱི་སྡུག་བསྔལ་མྱོང་བར་འགྱུར་རམ།
en: Subhūti, do the tathāgatas experience the suffering of the animal realm?”

source: རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པའི་ཆོས་ཟག་པ་མེད་པ་དང་ལྡན་པ་ཡང་ཆེད་དུ་བསམས་ཤིང་དེ་ལྟ་བུའི་ལུས་ཡོངས་སུ་འཛིན་ཏེ། ལུས་དེ་དག་གིས་སེམས་ཅན་རྣམས་ཅི་རིགས་ཅི་ཚུལ་དུ་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ།
en: Similarly, Subhūti,” continued the Blessed One, “even bodhisattva great beings who possess the uncontaminated attributes of sublime beings may voluntarily assume such corporeal forms by which they might bring beings of whatever species to maturity in whatever way.

source: །རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། དགྲ་བཅོམ་པས་སྤྲུལ་པ་མངོན་པར་སྤྲུལ་ན། སྤྲུལ་པ་དེས་དགྲ་བཅོམ་པའི་ལས་བྱས་ཤིང་ལས་དེས་གཞན་གྱི་དགེ་བ་སྐྱེ་བར་འགྱུར་བ་ཡོད་དམ།
en: Subhūti, do you think that if an arhat were to conjure up an emanation, could that emanation undertake the activities of an arhat, giving rise through those activities to the joy of others?” “

source: རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་དེ་བཞིན་ཏེ་མཆིས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Yes, Blessed Lord, it is so!” “

source: རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པའི་ཆོས་ཟག་པ་མེད་པ་དང་ལྡན་པ་ཡང་ཆེད་དུ་བསམས་ཤིང་དེ་ལྟ་བུའི་ལུས་ཡོངས་སུ་འཛིན་ཏེ། ཅི་རིགས་ཅི་ཚུལ་དུ་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །དེ་ལྟ་བུའི་ལུས་དེས་སྡུག་བསྔལ་དུ་ཡང་མི་འགྱུར་ཏེ། སྡུག་བསྔལ་གྱི་ཚོར་བ་ཡང་ཉམས་སུ་མི་མྱོང་ངོ་། །རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས།
en: Similarly, Subhūti,” continued the Blessed One, “even bodhisattva great beings who possess the attributes of sublime beings, free from contaminants, may voluntarily assume such corporeal forms and bring beings of whatever species to maturity in whatever way, but through such corporeal forms they do not become subject to suffering and they do not experience even the sensation of suffering. “

source: སྒྱུ་མའི་མཁན་པོས་སྒྱུ་མ་ལས་གླང་པོའི་གཟུགས་སམ། རྟའི་གཟུགས་སམ། གླང་གི་གཟུགས་ཤིག་བསྟན་ཏམ། གཞན་ཡང་སྒྱུ་མ་རྣམ་པ་སྣ་ཚོགས་བསྟན་ན། དེ་དག་ལ་གླང་པོའི་གཟུགས་སམ། རྟའི་གཟུགས་སམ། གླང་གི་གཟུགས་སམ། སྲོག་ཆགས་ཀྱི་རིགས་གཞན་དག་ཏུ་ཡང་འགྱུར་བ་ཡོད་དམ།
en: Subhūti, do you think that if an illusionist through magic were to display the form of an elephant, the form of a horse, or the form of a bull—or were to display other diverse magical forms—would those really turn into the form of an elephant, the form of a horse, the form of an ox, or the form of another sort of living creature?” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པའི་ཆོས་ཟག་པ་མེད་པ་དང་ལྡན་པ་ཡང་ཆེད་དུ་བསམས་ཤིང་དེ་ལྟ་བུའི་ལུས་ཡོངས་སུ་འཛིན་ཏེ། ལུས་དེ་དག་གིས་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་དེ། སྡུག་བསྔལ་གྱི་ཚོར་བར་འགྱུར་བ་གང་ཡང་མེད་དོ།
en: Similarly, Subhūti,” continued the Blessed One, “even bodhisattva great beings who possess the attributes of sublime beings, free from contamination, may voluntarily assume such corporeal forms, and through these corporeal forms act on behalf of beings, but they have no sensation of suffering at all.”

source: །རབ་འབྱོར་གྱིས་གསོལ་པ། ཀྱེ་མ་བཅོམ་ལྡན་འདས་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པའི་ཡེ་ཤེས་ཟག་པ་མ་མཆིས་པ་དང་། དེ་ལྟར་ལྡན་ཞིང་ལུས་གང་དང་གང་གིས་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་འགྱུར་བ་དེ་དང་དེ་ལྟ་བུའི་ལུས་ཡོངས་སུ་འཛིན་པ་ནི་ཐབས་ཤིན་དུ་མཁས་པ་སྟེ། དེ་ནི་ངོ་མཚར་ཆེའོ།
en: Subhūti then said, “O Blessed Lord, most wonderful is this skill in means through which bodhisattva great beings possessing the uncontaminated wisdom of sublime beings assume such corporeal forms, by which they act on behalf of beings!

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་དཀར་པོ་གང་དང་གང་ལ་གནས་ཤིང་། དེ་ལྟ་བུའི་ཐབས་མཁས་པ་བགྱིད་ཀྱང་ལས་དེ་ལྟ་བུས་མི་གོས་པར་སྤྱོད་པ་ལགས།
en: Blessed Lord, in which pure attributes do bodhisattva great beings dwell when they employ such skill in means, but act without being tainted by such actions?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་།
en: Subhūti,” replied the Blessed One, “bodhisattva great beings dwell in the perfection of wisdom {Ki.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟ་བུའི་ཐབས་མཁས་པ་ལ་སྤྱོད་དེ་ཐབས་མཁས་པ་དེ་དག་གིས་ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ཏུ་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་ཀྱང་།
en: VIII: 134} when they employ such skill in means. Through that skill in means, they may act on behalf of beings in the world systems in each of the ten directions, numerous as the grains of sand of the river Gaṅgā, but they do not hanker after anything at all.

source: དེས་དེ་ལ་གང་ཡང་རེག་པར་འགྱུར་བ་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་གང་རེག་པར་བྱེད་པ་དང་། གང་གིས་རེག་པར་བྱ་བ་དང་། གང་ལ་རེག་པར་བྱ་བ་དེ་ལྟ་བུའི་ཆོས་གསུམ་པོ་དེ་དག་ཐམས་ཅད་མི་དམིགས་ཏེ།
en: If you ask why, it is because bodhisattva great beings do not apprehend anything in terms of the threefold interaction that would cause hankering, by which they would hanker, or after which they would hanker.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་ཆོས་གསུམ་པོ་དེ་དག་ཐམས་ཅད་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པས་སྟོང་པ་ཉིད་ནི་སྟོང་པ་ཉིད་ལ་རེག་པར་མི་བྱེད་དོ།
en: If you ask why, it is because all aspects of this threefold interaction are empty of inherent existence, and so emptiness does not hanker after emptiness.

source: །སྟོང་པ་ཉིད་ཀྱིས་ཆོས་གང་ལ་ཡང་རེག་པར་མི་འགྱུར་རོ། །སྟོང་པ་ཉིད་ཀྱང་རེག་པར་བྱ་བ་མ་ཡིན་ནོ།
en: Emptiness does not hanker after anything at all, nor indeed can emptiness be hankered after.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་སྟོང་པ་ཉིད་ལ་སྟོང་པ་ཉིད་མི་དམིགས་སོ།
en: If you ask why, it is because emptiness does not apprehend emptiness.

source: །དེ་ནི་མི་དམིགས་པ་སྟོང་པ་ཉིད་དེ།
en: This, Subhūti, is the emptiness of nonapprehensibility.

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཅི་ལགས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་གཞན་ལ་མི་གནས་ཀྱི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འབའ་ཤིག་ལ་གནས་ཤིང་རྣམ་པ་དེ་ལྟ་བུའི་ཐབས་མཁས་པ་ལ་སྤྱོད་པ་ལགས་སམ།
en: Blessed Lord, why do bodhisattva great beings, without abiding in other attributes, dwell in the perfection of wisdom alone when they employ such skill in means?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཆོས་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཁོངས་སུ་མ་ཆུད་པ་དེ་ལྟ་བུ་ཡོད་དམ།
en: Subhūti,” asked the Blessed One in return, “what attributes are there that are not included in the perfection of wisdom?” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་གལ་ཏེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་ན། ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཁོངས་སུ་ཆོས་ཐམས་ཅད་འདུ་བ་ལགས།
en: Blessed Lord, if the perfection of wisdom is empty of inherent existence, in what way are all phenomena gathered within the perfection of wisdom?

source: བཅོམ་ལྡན་འདས་སྟོང་པ་ཉིད་ལ་ནི་ཆོས་གང་ཡང་ཁོངས་སུ་ཆུད་པ་འམ། ཁོངས་སུ་མ་ཆུད་པ་ཞེས་བགྱི་བ་མ་མཆིས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, there is nothing at all that is either included or not included in emptiness.” “

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་ཆོས་ཐམས་ཅད་ཀྱིས་མི་སྟོང་ངམ།
en: Subhūti, are all phenomena not empty of all phenomena?”

source: བཅོམ་ལྡན་འདས་སྟོང་ངོ་། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Yes, Blessed Lord, they are empty [of all phenomena].” “

source: རབ་འབྱོར་དེ་སྟེ་ཆོས་ཐམས་ཅད་ཆོས་ཐམས་ཅད་ཀྱིས་སྟོང་ན། ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་དུ་མ་འདུས་སམ།
en: Subhūti, if all phenomena are empty of all phenomena, are all phenomena not gathered within emptiness?”

source: བཅོམ་ལྡན་འདས་དེ་དེ་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Yes, they are, Blessed Lord.” “

source: རབ་འབྱོར་རྣམ་གྲངས་དེས་ན་ཁྱོད་ཀྱིས་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་དེ་ལྟ་བུའི་ཐབས་མཁས་པ་ལ་སྤྱོད་པར་རིག་པར་བྱའོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: For that reason, Subhūti,” continued the Blessed One, “you should know that bodhisattva great beings dwell in the perfection of wisdom in that manner and employ such skill in means.”

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་ལ་གནས་ཏེ། མངོན་པར་ཤེས་པ་གང་ལ་གནས་ཤིང་ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ཏུ་མཆི་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་ཅིག་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དང་། ཆོས་སྟོན་པ་དེ་དག་ལ་བསྙེན་བཀུར་བགྱིད་པ་དང་། ཆོས་ཉན་ཅིང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པའི་མངོན་པར་ཤེས་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་སྒྲུབ་པ་ལགས།
en: Then the venerable Subhūti asked the Blessed One, “Blessed Lord, when bodhisattva great beings practice the perfection of wisdom and dwell in the emptiness of all phenomena, in what extrasensory powers are they certain to progress, and do they actualize the perfection of extrasensory powers through which they may travel to all world systems in each of the ten directions, numerous as the grains of sand of the river Gaṅgā; venerate all those lord buddhas who are alive at present in those world systems, teaching the Dharma; listen to the Dharma; and develop the roots of virtuous actions in the presence of those lord buddhas?” {

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་པོ་དེ་དག་ཐམས་ཅད་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པར་མཐོང་ངོ་།
en: VIII: 135} The Blessed One replied to the venerable Subhūti, “In this regard, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they see that all those world systems in each of the ten directions, numerous as the grains of sand of the river Gaṅgā, are empty of inherent existence.

source: །འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་ཅིག་བཞུགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཀྱང་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པར་མཐོང་ངོ་།
en: They see that all the lord buddhas who reside in those world systems are also empty of inherent existence.

source: །གཞན་དུ་ན་མིང་དང་བརྡར་གདགས་པ་ཉེ་བར་བཟུང་ཞིང་བསྟན་པ་མ་གཏོགས་ཏེ། གདགས་པ་ཀུན་ཀྱང་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་ངོ་།
en: In addition, these are [merely] described through names and symbols that depend on concepts, and apart from that, all concepts are also empty of inherent existence.

source: །གལ་ཏེ་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ཀྱང་ངོ་བོ་ཉིད་ཀྱིས་མི་གཏོང་ལ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཀྱང་ངོ་བོ་ཉིད་ཀྱིས་མི་སྟོང་སྟེ། གདགས་པའི་རྒྱུད་དེ་དག་ཀྱང་ངོ་བོ་ཉིད་ཀྱིས་མི་སྟོང་པ་ཞིག་ཡིན་ན་ནི། ཉི་ཚེ་བའི་སྟོང་པ་ཉིད་དུ་འགྱུར་ཏེ།
en: If those world systems were not empty of inherent existence, if all those lord buddhas, too, were not empty of inherent existence, and if those concepts and ideas, too, were not empty of inherent existence, there would be [only] a limited emptiness.

source: དེ་འང་སྟོང་པ་ཉི་ཚེ་མ་ཡིན་ནོ། །དེའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཆོས་ཐམས་ཅད་ཀྱིས་སྟོང་སྟེ།
en: Indeed, it is because emptiness is not limited that all phenomena are empty of all phenomena.

source: དེ་ཉིད་ཀྱི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་མཁས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། མངོན་པར་ཤེས་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་སྒྲུབ་སྟེ།
en: For this very reason, bodhisattva great beings practice the perfection of wisdom through skill in means and actualize the perfection of extrasensory powers.

source: མངོན་པར་ཤེས་པ་དེ་དག་ལ་གནས་ཤིང་ལྷའི་མིག་དང་ལྷའི་རྣ་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྣམ་པ་དང་། ཕ་རོལ་གྱི་སེམས་ཤེས་པ་དང་། སྔོན་གྱི་གནས་དྲན་པ་དང་། འཆི་འཕོ་ཤེས་པ་མངོན་པར་སྒྲུབ་སྟེ།
en: Stable in those extrasensory powers, they actualize divine clairvoyance, divine clairaudience, the aspects of miraculous ability, the knowledge of other minds, the recollection of past lives, and knowledge of death and transmigration.

source: མངོན་པར་ཤེས་པ་མེད་པར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་ནུས་སོ།
en: Without these extrasensory powers, great bodhisattva beings cannot attain consummate buddhahood in unsurpassed, complete enlightenment.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱང་ཆུབ་ནི་མངོན་པར་ཤེས་པའི་ཕ་རོལ་དུ་ཕྱིན་པར་འདུས་ཏེ།
en: If you ask why, it is because the enlightenment of bodhisattva great beings is gathered in the perfection of the extrasensory powers.

source: མངོན་པར་ཤེས་པ་དེ་དག་ལས་བྱང་ཆུབ་ཡོངས་སུ་བཙལ་བར་བྱའོ།
en: That is to say, enlightenment should be sought through those extrasensory powers. “

source: །དེ་ཚོལ་བའི་ཚེ་ལྷའི་མིག་རྣམ་པར་དག་པ་མི་ལས་འདས་པས་བདག་ཉིད་ཀྱིས་ཀྱང་དགེ་བའི་ཆོས་ཐམས་ཅད་མཐོང་། གཞན་ཡང་དགེ་བའི་ཆོས་ཐམས་ཅད་ལ་སྦྱོར་ཏེ། དགེ་བའི་ཆོས་དེ་དག་ལ་མངོན་པར་ཞེན་པར་འགྱུར་བ་མེད་དོ།
en: When they seek that [enlightenment] through pure divine clairvoyance, surpassing that of human beings, they themselves see all virtuous attributes, and they also engage others in all virtuous attributes, but they do not become fixated on those virtuous attributes.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དགེ་བའི་ཆོས་དེ་དག་ཐམས་ཅད་ནི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པ་སྟེ།
en: If you ask why, all those virtuous attributes are empty of inherent existence.

source: སྟོང་པ་ཉིད་ནི་གང་ལ་མངོན་པར་ཞེན་ཅིང་རོ་མྱོང་བར་བྱེད་པར་མངོན་པར་ཞེན་པར་འགྱུར་བ་མེད་དེ།
en: One cannot be fixated on emptiness, relishing that on which one is fixated.

source: སྟོང་པ་ཉིད་ནི་རོ་མྱོང་བར་བྱེད་པ་མེད་དོ།
en: Emptiness is not relished.

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ལྷའི་མིག་མངོན་པར་སྒྲུབ་སྟེ།
en: When bodhisattva great beings practice the perfection of wisdom in that manner they actualize divine clairvoyance.

source: ལྷའི་མིག་དེས་ཆོས་ཐམས་ཅད་ཀྱང་སྟོང་པ་ཉིད་དུ་མཐོང་སྟེ།
en: That is to say, through divine clairvoyance they see all phenomena as emptiness.

source: དེ་ཆོས་དེ་དག་ལ་གནས་ཤིང་ལས་མངོན་པར་སྒྲུབ་བོ། །ལས་མངོན་པར་བསྒྲུབས་པ་དེས། སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏེ། སེམས་ཅན་ནམ་སེམས་ཅན་དུ་གདགས་པར་དམིགས་པ་མེད་དོ།
en: Based on these phenomena, they engage in action, and, having engaged in action, they teach the Dharma to beings, but do not apprehend either beings or the concept of beings.

source: །དེ་ལྟར་མི་དམིགས་པའི་ཚུལ་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མངོན་པར་ཤེས་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་སྒྲུབ་སྟེ།
en: Without apprehending anything in that manner, bodhisattva great beings actualize the perfection of the extrasensory powers.

source: མངོན་པར་ཤེས་པ་དེ་དག་གིས་མངོན་པར་ཤེས་པར་བྱ་བའི་ཆོས་གང་ཇི་སྙེད་པ་དེ་དག་བྱེད་དོ།
en: Through those extrasensory powers they effect all that is to be achieved through extrasensory powers.

source: །དེ་ལྷའི་མིག་རྣམ་པར་དག་པ་མི་ལས་འདས་པ་དེ་ཉིད་ཀྱིས་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་མཐོང་སྟེ། དེ་དེ་དག་ཏུ་རྫུ་འཕྲུལ་གྱིས་སོང་ཞིང་སྦྱིན་པ་འམ། ཚུལ་ཁྲིམས་སམ། བཟོད་པ་འམ། བརྩོན་འགྲུས་སམ། བསམ་གཏན་ནམ།
en: That is to say, through this pure divine clairvoyance itself, surpassing that of human beings, they see all world systems of the eastern direction. {

source: ཤེས་རབ་བམ།
en: Ki.

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་སམ། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་འམ། བསམ་གཏན་རྣམས་སམ། ཚད་མེད་པ་རྣམས་སམ། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་སམ། རྣམ་པར་ཐར་པ་རྣམས་སམ། ཏིང་ངེ་འཛིན་རྣམས་སམ།
en: VIII: 136} Traversing all these through miraculous ability, they act for the benefit of beings by means of generosity, ethical discipline, tolerance, perseverance, meditative concentration, wisdom, the factors conducive to enlightenment, the gateways of liberation—emptiness, signlessness, and wishlessness—the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the meditative stabilities, the serial steps of meditative absorption, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, the distinct qualities of the buddhas, the attributes of the śrāvakas, the attributes of the pratyekabuddhas, the attributes of the bodhisattvas, and the attributes of the buddhas.

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་སམ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་སམ། མི་འཇིགས་པ་རྣམས་སམ། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་སམ། །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་སམ། ཉན་ཐོས་ཀྱི་ཆོས་སམ། རང་སངས་རྒྱས་ཀྱི་ཆོས་སམ།
en: In that way they act on behalf of those beings. “

source: བྱང་ཆུབ་སེམས་དཔའི་ཆོས་སམ། སངས་རྒྱས་ཀྱི་ཆོས་ཀྱིས་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་ཅིང་། སེམས་ཅན་དེ་དག་གི་བྱ་བ་བྱེད་དེ་དེ་ལ་སེམས་ཅན་སེར་སྣ་ཅན་གང་ཇི་སྙེད་པ་དེ་དག་ལ་འདི་སྐད་དུ་ཆོས་སྟོན་ཏེ། སྦྱིན་པ་བྱིན་ཅིག །
en: To all those beings who are miserly they teach the Dharma, saying, ‘You should give gifts!

source: ཕོངས་པ་ནི་སྡུག་བསྔལ་བ་སྟེ།
en: Deprivation is imbued with suffering.

source: ཕོངས་པས་ནི་བདག་གི་དོན་ཀྱང་བྱ་བར་མི་ནུས་ན།
en: Through deprivation you cannot achieve your own welfare, let alone the welfare of others.

source: གཞན་གྱི་དོན་ལྟ་ཅི་སྨོས་ཀྱིས་དེ་ལྟར་ཁྱོད་ཀྱིས་སྦྱིན་པ་བྱིན་ལ་བདག་ཀྱང་བདེ་བར་གྱིས་ཤིག །གཞན་ཡང་བདེ་བར་གྱིས་ཤིག་ཕོངས་པས་ཟིལ་གྱིས་ནོན་ཅིང་ཉིང་ཤ་ཉིང་གིས་ཟོས་ཏེ།
en: So you should give gifts, and ensure that you yourself will be happy and that others too will be happy.

source: ངན་སོང་གསུམ་ལས་མི་ཐར་བར་གྱུར་ཏ་རེ་ཞེས་ཆོས་སྟོན་ཏོ།
en: Those oppressed by deprivation, consuming one another’s flesh, cannot be liberated from the three inferior realms.’ “

source: །སེམས་ཅན་ཚུལ་ཁྲིམས་ངན་པ་ཅན་གང་ཇི་སྙེད་པ་དེ་དག་ལ་འདི་སྐད་དུ་ཆོས་སྟོན་ཏེ། ཀྱེ་སྐྱེས་བུ་དག་ཚུལ་ཁྲིམས་ངན་པ་ནི་སྡུག་བསྔལ་བ་སྟེ།
en: To all those being beings who indulge in immorality, they teach the Dharma, saying, ‘O people, immorality is imbued with suffering.

source: ཚུལ་ཁྲིམས་ངན་པས་ནི་བདག་གི་དོན་ཀྱང་བྱ་བར་མི་ནུས་ན། གཞན་གྱི་དོན་ལྟ་ཅི་སྨོས་ཏེ།
en: Through immorality you cannot achieve your own welfare, let alone the welfare of others.

source: ཚུལ་ཁྲིམས་ངན་པའི་རྣམ་པར་སྨིན་པ་ནི། སེམས་ཅན་དམྱལ་བ་འམ། བྱོལ་སོང་གི་སྐྱེ་གནས་སམ། གཤིན་རྗེའི་འཇིག་རྟེན་ཡིན་ཏེ།
en: The ripening effect of immorality is [rebirth in] the hells, the animal realm, or the world of Yama.

source: དེ་ལྟར་ཁྱོད་ངན་སོང་གསུམ་དུ་ལྷུང་ན་བདག་ཅག་ཀྱང་གདོན་པར་མི་ནུས་ན། གཞན་གདོན་པ་ལྟ་ཅི་སྨོས་ཀྱིས།
en: If you fall into the three inferior realms in that manner, you cannot extricate yourself, let alone others.

source: དེའི་ཕྱིར་ཁྱེད་ཀྱིས་ཚུལ་ཁྲིམས་ངན་པའི་སེམས་འགའ་ཙམ་གྱི་གོ་སྐབས་ཀྱང་མི་དབྱེའོ། །ཕྱིས་འགྱོད་པ་ཅན་དུ་གྱུར་ཏ་རེ་ཞེས་ཆོས་སྟོན་ཏོ།
en: So you should give no opportunity for any thoughts of immorality [to arise] and later you will not be remorseful!’ “

source: །སེམས་ཅན་ཕན་ཚུན་གནོད་སེམས་སུ་གྱུར་པ་ཇི་སྙེད་པ་དེ་དག་ལ་འདི་སྐད་དུ་ཆོས་སྟོན་ཏེ། དེ་ལྟར་ཁྱེད་གཅིག་ལ་གཅིག་གནོད་སེམས་སུ་མ་བྱེད་ཅིག །
en: To all those being beings who have thoughts of malice for one another, they teach the Dharma, saying, ‘You should not have thoughts of malice for one another!

source: སེམས་འཁྲུགས་པར་གྱུར་པ་ལ་དགེ་བའི་ཆོས་གང་ཡང་སྐྱེ་བར་མི་འགྱུར་ཏེ།
en: No virtuous attributes at all will arise for those who resort to anger.

source: དེ་ལྟ་བས་ན་ཁྱེད་ཕན་ཚུན་སེམས་འཁྲུགས་པར་གྱུར་ན་སེམས་ཅན་དམྱལ་བར་སྐྱེ་བ་འམ། བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་སྐྱེ་བ་འམ།
en: If you resort to anger for one another in that manner, you will be reborn in the hells, you will be reborn in the animal realm, or you will be reborn in the world of Yama.

source: གཤིན་རྗེའི་འཇིག་རྟེན་དུ་སྐྱེ་བའི་གནས་ཡིན་གྱིས་དེ་བས་ན་ཁྱེད་ཀྱིས་འཁྲུགས་པའི་སེམས་ནི་འགའ་ཙམ་གྱི་གོ་སྐབས་ཀྱང་མི་དབྱེའོ། །ཕྱིས་འགྱོད་པ་ཅན་དུ་གྱུར་ཏ་རེ་ཞེས་ཆོས་སྟོན་ཏོ།
en: So you should give no opportunity for any thoughts of anger [to arise] and later you will not be remorseful!’ “

source: །སེམས་ཅན་ལེ་ལོ་ཅན་གང་ཇི་སྙེད་པ་དེ་དག་ལ་འདི་སྐད་དུ་ཆོས་སྟོན་ཏོ། །ཀྱེ་སྐྱེས་བུ་དག་ལེ་ལོ་ནི་སྡུག་བསྔལ་བ་སྟེ།
en: To all those being beings who are indolent, they teach the Dharma, saying, ‘O people, indolence is imbued with suffering.

source: ལེ་ལོས་ནི་བདག་གི་དོན་ཀྱང་བྱ་བར་མི་ནུས་ན་གཞན་གྱི་དོན་ལྟ་ཅི་སྨོས་ཏེ།
en: Through indolence you cannot achieve your own welfare, let alone the welfare of others.

source: ལེ་ལོའི་རྣམ་པར་སྨིན་པ་ནི་སེམས་ཅན་དམྱལ་བ་འམ། བྱོལ་སོང་གི་སྐྱེ་གནས་སམ། གཤིན་རྗེའི་འཇིག་རྟེན་ཡིན་ཏེ།
en: The ripening effect of indolence is [rebirth in] the hells, the animal realm, or the world of Yama.

source: དེ་ལྟར་ཁྱེད་ངན་སོང་གསུམ་དུ་ལྷུང་ན། བདག་ཅག་ཀྱང་གདོན་པར་མི་ནུས་ན། གཞན་གདོན་པ་ལྟ་ཅི་སྨོས་ཀྱིས།
en: If you fall into the three inferior realms in that manner, you cannot extricate yourself, let alone others.

source: དེའི་ཕྱིར་ཁྱོད་ཀྱིས་ལེ་ལོའི་སེམས་འགའ་ཙམ་གྱི་གོ་སྐབས་ཀྱང་མི་དབྱེའོ། །ཕྱིས་འགྱོད་པ་ཅན་དུ་གྱུར་ཏ་རེ་ཞེས་ཆོས་སྟོན་ཏོ།
en: So you should give no opportunity for any thoughts of indolence [to arise] and later you will not be remorseful!’ “

source: །སེམས་ཅན་སེམས་གཡེང་བ་གང་ཇི་སྙེད་པ་དེ་དག་ལ་འདི་སྐད་དུ་ཆོས་སྟོན་ཏེ། ཀྱེ་སྐྱེས་བུ་དག་སེམས་གཡེང་བ་ནི་སྡུག་བསྔལ་བ་སྟེ།
en: To all those being beings who have thoughts of distraction, {Ki.VIII: 137} they teach the Dharma, saying, ‘O people, distraction is imbued with suffering.

source: གང་སེམས་གཡེང་བའི་རྣམ་པར་སྨིན་པ་ནི་སེམས་ཅན་དམྱལ་བ་འམ། བྱོལ་སོང་གི་སྐྱེ་གནས་སམ། གཤིན་རྗེའི་འཇིག་རྟེན་ཡིན་ཏེ།
en: The ripening effect of distraction is [rebirth in] the hells, the animal realm, or the world of Yama.

source: དེའི་ཕྱིར་ཁྱེད་ཀྱིས་གཡེང་བའི་སེམས་འགའ་ཙམ་གྱི་གོ་སྐབས་ཀྱང་མི་དབྱེའོ། །ཕྱིས་འགྱོད་པ་ཅན་དུ་གྱུར་ཏ་རེ་ཞེས་ཆོས་སྟོན་ཏོ།
en: So you should give no opportunity for any thoughts of distraction [to arise] and later you will not be remorseful!’ “

source: །སེམས་ཅན་ཤེས་རབ་འཆལ་པ་ཅན་གང་ཇི་སྙེད་པ་དེ་དག་ལ་འདི་སྐད་དུ་ཆོས་སྟོན་ཏེ། ཀྱེ་སྐྱེས་བུ་དག་ཤེས་རབ་འཆལ་བ་ནི་སྡུག་བསྔལ་བ་སྟེ།
en: To all those being beings who have thoughts of stupidity, they teach the Dharma, saying, ‘O people, stupidity is imbued with suffering.

source: ཤེས་རབ་འཆལ་པས་ནི་བདག་གི་དོན་ཀྱང་བྱ་བར་མི་ནུས་ན། གཞན་གྱི་དོན་ལྟ་ཅི་སྨོས་ཏེ།
en: Through stupidity you cannot achieve your own welfare, let alone the welfare of others.

source: གང་ཤེས་རབ་འཆལ་བའི་རྣམ་པར་སྨིན་པ་ནི་སེམས་ཅན་དམྱལ་བ་འམ། བྱོལ་སོང་གི་སྐྱེ་གནས་སམ། གཤིན་རྗེའི་འཇིག་རྟེན་ཡིན་ཏེ།
en: The ripening effect of stupidity is [rebirth in] the hells, the animal realm, or the world of Yama.

source: དེ་ལྟར་ཁྱེད་ཀྱིས་ཤེས་རབ་འཆལ་པའི་སེམས་འགའ་ཙམ་གྱི་གོ་སྐབས་ཀྱང་མི་དབྱེའོ། །ཕྱིས་འགྱོད་པ་ཅན་དུ་གྱུར་ཏ་རེ་ཞེས་ཆོས་སྟོན་ཏོ།
en: So you should give no opportunity for any thoughts of stupidity [to arise] and later you will not be remorseful!’ “

source: །འདོད་ཆགས་ཀྱི་སྤྱོད་པ་ཅན་གང་ཇི་སྙེད་པ་དེ་དག་ནི་མི་སྡུག་པ་ལ་སྦྱོར་རོ།
en: They engage all those who act from desire in [the meditation on] the repulsiveness of things.

source: །ཞེ་སྡང་གི་སྤྱོད་པ་ཅན་གང་ཇི་སྙེད་པ་དེ་དག་ནི་བྱམས་པ་ལ་སྦྱོར་རོ།
en: They engage all those who act from hatred in [the meditation on] loving kindness.

source: །གཏི་མུག་གི་སྤྱོད་པ་ཅན་གང་ཇི་སྙེད་པ་དེ་དག་ནི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་སྦྱོར་རོ།
en: They engage all those who act from delusion to engage in [the meditation on] dependent origination.

source: །ལམ་ངན་པར་ཞུགས་པ་གང་ཇི་སྙེད་པ་དེ་དག་ནི་ཡང་དག་པའི་ལམ་ལ་སྦྱོར་ཏེ། ཉན་ཐོས་ཀྱི་ལམ་འམ། རང་སངས་རྒྱས་ཀྱི་ལམ་འམ།
en: They engage all those who have set out on negative paths to [engage in] the correct paths, engaging them in the path of the śrāvakas, the path of the pratyekabuddhas, or the path of the buddhas.

source: སངས་རྒྱས་ཀྱི་ལམ་ལ་སྦྱོར་ཞིང་དེ་དག་ལ་འདི་སྐད་དུ་ཆོས་སྟོན་ཏེ། ཁྱེད་ཅག་ཆོས་གང་ལ་མངོན་པར་ཞེན་པར་གྱུར་པའི་ཆོས་དེ་དག་ནི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་སྟེ།
en: To all of them, they teach the Dharma, saying, ‘These phenomena on which you are fixated are empty of inherent existence.

source: ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཆོས་རྣམས་ནི་མངོན་པར་ཞེན་པར་མི་ནུས་ཏེ།
en: You cannot be fixated on phenomena that are empty of inherent existence.

source: སྟོང་པ་ཉིད་ལ་མངོན་པར་ཞེན་པ་མེད་དོ། །ཞེས་ཆོས་སྟོན་ཏེ།
en: There is no fixation in emptiness.’ “
